azhel12/Zhele/include/zhele/platform/stm32/common/impl/clock.h
/**
 * @file
 * Clock methods implementation
 * 
 * @author Konstantin Chizhov
 * @date 2018
 * @license MIT
 */

#ifndef ZHELE_PLATFORM_STM32_COMMON_IMPL_CLOCK_H
#define ZHELE_PLATFORM_STM32_COMMON_IMPL_CLOCK_H

#if !defined  (HSE_VALUE) 
    #warning HSE_VALUE not defined. Will be used HSE_VALUE equals 8 MHZ.
    #define HSE_VALUE    ((uint32_t)8000000)
#endif //! HSE_VALUE

#if !defined  (HSI_VALUE)
    #warning HSI_VALUE not defined. Will be used HSI_VALUE equals 8 MHZ.
    #define HSI_VALUE    ((uint32_t)8000000)
#endif //! HSI_VALUE

namespace Zhele::Clock
{
    template <typename _Regs>
    bool ClockBase<_Regs>::EnableClockSource(unsigned turnMask, unsigned waitReadyMask)
    {
        uint32_t timeoutCounter = 0;
        _Regs::Or(turnMask);
        while(((_Regs::Get() & waitReadyMask) == 0) && (timeoutCounter < ClockStartTimeout))
        {
            timeoutCounter++;
        }
        return (_Regs::Get() & waitReadyMask) != 0;  
    }

    template <typename _Regs>
    bool ClockBase<_Regs>::DisableClockSource(unsigned turnMask, unsigned waitReadyMask)
    {
        uint32_t timeoutCounter = 0;
        _Regs::And(~turnMask);
        while(((_Regs::Get() & waitReadyMask) != 0) && (timeoutCounter < ClockStartTimeout))
        {
            timeoutCounter++;
        }
        return (_Regs::Get() & waitReadyMask) == 0;
    }

    template<typename _SrcClock, typename _PrescalerBitField>
    ClockFrequenceT BusClock<_SrcClock, _PrescalerBitField>::SrcClockFreq()
    {
        return _SrcClock::ClockFreq();
    }

    template<typename _SrcClock, typename _PrescalerBitField>
    template<typename PrescalerType>
    void BusClock<_SrcClock, _PrescalerBitField>::SetPrescaler(PrescalerType prescaler)
    {
        _PrescalerBitField::Set(static_cast<ClockFrequenceT>(prescaler));
    }

    template<typename _Reg, unsigned _Mask, typename _ClockSrc>
    void ClockControl<_Reg, _Mask, _ClockSrc>::Enable()
    {
        _Reg::Or(_Mask);
    }

    template<typename _Reg, unsigned _Mask, typename _ClockSrc>
    void ClockControl<_Reg, _Mask, _ClockSrc>::Disable()
    {
        _Reg::And(~_Mask);
    }

    inline bool HseClock::Enable()
    {
        return ClockBase::EnableClockSource(RCC_CR_HSEON, RCC_CR_HSERDY);
    }

    inline bool HseClock::Disable()
    {
        return ClockBase::DisableClockSource(RCC_CR_HSEON, RCC_CR_HSERDY);
    }

    inline bool HsiClock::Enable()
    {
        return ClockBase::EnableClockSource(RCC_CR_HSION, RCC_CR_HSIRDY);
    }

    inline bool HsiClock::Disable()
    {
        return ClockBase::DisableClockSource(RCC_CR_HSION, RCC_CR_HSIRDY);
    }

    constexpr ClockFrequenceT HseClock::SrcClockFreq() { return HSE_VALUE; }
    constexpr unsigned HseClock::GetDivider() { return 1; }
    constexpr unsigned HseClock::GetMultipler() { return 1; }
    constexpr ClockFrequenceT HseClock::ClockFreq() { return SrcClockFreq(); }


    constexpr ClockFrequenceT HsiClock::SrcClockFreq() { return HSI_VALUE; }
    constexpr unsigned HsiClock::GetMultipler() { return 1; }
#if !defined (STM32C0) && !defined (STM32H5)
    constexpr unsigned HsiClock::GetDivider() { return 1; }
    constexpr ClockFrequenceT HsiClock::ClockFreq() { return SrcClockFreq(); }
#endif

// PLL bodies are gated on RCC_CFGR_SWS_PLL: families without a PLL (e.g. C0) leave it
#if defined(RCC_CFGR_SWS_PLL)
    inline ClockFrequenceT PllClock::SrcClockFreq()
    {
        return GetClockSource() == External
            ? HseClock::ClockFreq()
            : HsiClock::ClockFreq();
    }

    inline ClockFrequenceT PllClock::ClockFreq()
    {
        return SrcClockFreq() / GetDivider() * GetMultipler();
    }

    inline bool PllClock::Enable()
    {
        if (GetClockSource() == Internal)
        {
            if (!HsiClock::Enable())
                return false;
        }
        else
        {
            if (!HseClock::Enable())
                return false;
        }
        return ClockBase::EnableClockSource(RCC_CR_PLLON, RCC_CR_PLLRDY);
    }

    inline void PllClock::Disable()
    {
        ClockBase::DisableClockSource(RCC_CR_PLLON, RCC_CR_PLLRDY);
    }
#endif

#if defined (RCC_CSR_LSION)
    inline bool LsiClock::Enable()
    {
        return ClockBase::EnableClockSource(RCC_CSR_LSION, RCC_CSR_LSIRDY);
    }

    inline bool LsiClock::Disable()
    {
        return ClockBase::DisableClockSource(RCC_CSR_LSION, RCC_CSR_LSIRDY);
    }
#endif

    template<SysClock::ClockSource clockSource>
    inline SysClock::ErrorCode SysClock::SelectClockSource()
    {
        uint32_t clockStatusValue;
        uint32_t clockSelectMask;
        uint32_t resultFrequence;

        if constexpr(clockSource == Internal)
        {
            clockStatusValue = RCC_CFGR_SWS_HSI;
            clockSelectMask = RCC_CFGR_SW_HSI;
            if (!HsiClock::Enable())
                return ClockSourceFailed;
            resultFrequence = HsiClock::ClockFreq();
        }
        else if constexpr(clockSource == External)
        {
            clockStatusValue = RCC_CFGR_SWS_HSE;
            clockSelectMask = RCC_CFGR_SW_HSE;
            if (!HseClock::Enable())
                return ClockSourceFailed;
            resultFrequence = HseClock::ClockFreq();
        }
#if defined(RCC_CFGR_SWS_PLL)
        else if constexpr(clockSource == Pll)
        {
            clockStatusValue = RCC_CFGR_SWS_PLL;
            clockSelectMask = RCC_CFGR_SW_PLL;
            if (!PllClock::Enable())
                return ClockSourceFailed;
            resultFrequence = PllClock::ClockFreq() / PllClock::GetSystemOutputDivider();
        }
#endif
        else {
            static_assert(false, "Invalid clock source");
        }

        Flash::ConfigureFrequence(resultFrequence);

        RccCfgrReg::Set((RccCfgrReg::Get() & ~static_cast<uint32_t>(RCC_CFGR_SW)) | clockSelectMask);

        uint32_t timeout = 10000;
        while (((RccCfgrReg::Get() & RCC_CFGR_SWS) != clockStatusValue) && --timeout)
            ;
        if(timeout == 0)
        {
            return ClockSelectFailed;
        }
        return Success;
    }

    inline ClockFrequenceT SysClock::ClockFreq()
    {
        uint32_t clockSrc = RccCfgrReg::Get() & RCC_CFGR_SWS;
        switch (clockSrc)
        {
            case RCC_CFGR_SWS_HSI: return HsiClock::ClockFreq();
            case RCC_CFGR_SWS_HSE: return HseClock::ClockFreq();
#if defined(RCC_CFGR_SWS_PLL)
            case RCC_CFGR_SWS_PLL: return PllClock::ClockFreq() / PllClock::GetSystemOutputDivider();
#endif
        }
        return 0;
    }

    inline ClockFrequenceT SysClock::SrcClockFreq()
    {
        return ClockFreq();
    }

#if defined (RCC_CSR_LSION)
    constexpr ClockFrequenceT LsiClock::SrcClockFreq()
    {
        return 32768;
    }

    constexpr unsigned LsiClock::GetDivider() { return 1; }

    constexpr unsigned LsiClock::GetMultipler() { return 1; }

    constexpr ClockFrequenceT LsiClock::ClockFreq()
    {
        return SrcClockFreq();
    }
#endif
}

#endif //! ZHELE_PLATFORM_STM32_COMMON_IMPL_CLOCK_H